EDTMKERPNEW.Разработка/src/InformationRegisters/Разр_ЯрлыкиКоробов/Разр_ЯрлыкиКоробов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Разр_ЯрлыкиКоробов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПереданПереработчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стерилизован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перемещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пересчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Упакован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Передвинут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ПересчетТоваров</types>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.УпаковочныйЛист</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTMKERPNEW.Разработка/src/CommonForms/Разр_ВводШтрихкодаОдиночный/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Значения по умолчанию
	ИмяСобытияОповещения = "НС_ШтрихкодСчитан";
	ТекстПодсказки = "Сканируйте штрихкод этикетки ТМЦ.";
	
	// Если форму открыли с параметрами — используем их
	Если Параметры.Свойство("ИмяСобытияОповещения") Тогда
		ИмяСобытияОповещения = Параметры.ИмяСобытияОповещения;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстПодсказки") Тогда
		ТекстПодсказки = Параметры.ТекстПодсказки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Сразу ставим курсор в поле штрихкода
	ТекущийЭлемент = Элементы.Штрихкод;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	
	КодШтрихкода = СокрЛП(Штрихкод);
	
	Если ПустаяСтрока(КодШтрихкода) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = Разр_ПроверитьЯрлыкКоробаПоШтрихкоду(КодШтрихкода);
	
	// Поле очищаем в любом случае
	Штрихкод = "";
	ТекущийЭлемент = Элементы.Штрихкод;
	
	Если Не РезультатПроверки.Успех Тогда
		ПоказатьПредупреждение(, РезультатПроверки.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// Пока только проверяем.
	Оповестить(ИмяСобытияОповещения, РезультатПроверки, ЭтаФорма);
	Сообщить("Ярлык найден: " + КодШтрихкода);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Разр_ПроверитьЯрлыкКоробаПоШтрихкоду(Штрихкод)
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	//Результат.Вставить("Номенклатура", Неопределено);
	//Результат.Вставить("ЭтапПроизводства", Неопределено);
	//Результат.Вставить("ЗаказКлиента", Неопределено);
	//Результат.Вставить("КоличествоУпаковок", Неопределено);
	//Результат.Вставить("Количество", Неопределено);
	//Результат.Вставить("Характеристика", Неопределено);
	//Результат.Вставить("АналитикаУчетаНоменклатуры", Неопределено);
	//Результат.Вставить("Назначение", Неопределено);
	//Результат.Вставить("Серия", Неопределено);
	//Результат.Вставить("Упаковка", Неопределено);
	//Результат.Вставить("Номер", "");
	//Результат.Вставить("Отгружен", Ложь);
	//Результат.Вставить("Стерилизован", Ложь);
	//Результат.Вставить("Спецификация", Неопределено);
	Результат.Вставить("Штрихкод", "");
	Результат.Вставить("НомерГруппыЗатрат", 1);
	Штрихкод = СокрЛП(Штрихкод);
	Результат.Штрихкод = Штрихкод;
	
	Штрихкод = СокрЛП(Штрихкод);
	
	Если СтрДлина(Штрихкод) < 26 ИЛИ  СтрДлина(Штрихкод) > 31 Тогда
		Результат.ТекстОшибки = "Некорректная длина штрихкода. Ожидается минимум 26 символов, максимум 31.";
		Возврат Результат;
	КонецЕсли;
	
	// 1-11 символы — код номенклатуры
	КодНоменклатуры = Сред(Штрихкод, 1, 11);
	
	// 13-24 символы — код этапа производства
	КодЭтапаПроизводства = Сред(Штрихкод, 13, 12);
	
	// с 26 символа, длина 6 — порядковый номер
	ПорядковыйНомер = Сред(Штрихкод, 26, 6);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ярлыки.Номенклатура КАК Номенклатура,
	|	Ярлыки.ЭтапПроизводства КАК ЭтапПроизводства,
	|	Ярлыки.Номер КАК Номер,
	|	Ярлыки.Отгружен КАК Отгружен,
	|	Ярлыки.Стерилизован КАК Стерилизован,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Количество КАК Количество,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка КАК Упаковка,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	Ярлыки.Серия КАК Серия,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ЗаказПереработчику КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ВыходныеИзделия.Спецификация.Код ЕСТЬ NULL
	|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация
	|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Спецификация
	|	КОНЕЦ КАК Спецификация,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Распоряжение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДокументОснование КАК РаспоряжениеДокументОснование,
	|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.Разр_ЯрлыкиКоробов КАК Ярлыки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|			ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение.ДокументОснование = ЗаказКлиентаТовары.Ссылка
	|				И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|				И ЭтапПроизводства2_2ВыходныеИзделия.Характеристика = ЗаказКлиентаТовары.Характеристика
	|		ПО Ярлыки.ЭтапПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	|ГДЕ
	|	Ярлыки.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", СокрЛП(Штрихкод));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Результат.ТекстОшибки =
		"Ярлык короба не найден." + СокрЛП(Штрихкод);
		Возврат Результат;
	КонецЕсли;
	
	
	Результат = Разр_ЗаполнениеТЧПоЯрлыкамСервер.СтруктураИзВыборки(РезультатЗапроса, Выборка, Результат);
	// Здесь ярлык найден
	//Результат.Номенклатура = Выборка.Номенклатура;
	//Результат.ЭтапПроизводства = Выборка.ЭтапПроизводства;
	//Результат.Номер = Выборка.Номер;
	//Результат.Отгружен = Выборка.Отгружен;
	//Результат.Характеристика = Выборка.Характеристика;
	////Результат.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры;
	//Результат.КоличествоУпаковок = Выборка.КоличествоУпаковок;
	//Результат.Количество = Выборка.Количество;
	//Результат.Упаковка = Выборка.Упаковка;
	//Результат.Стерилизован = Выборка.Стерилизован;
	//Результат.Назначение = Выборка.Назначение;
	//Результат.Серия = Выборка.Серия;
	//ЗаполнитьЗначенияСвойств(Результат,Выборка);
	
	//Если Результат.Отгружен Тогда
	//	Результат.ТекстОшибки =
	//	"Ярлык уже отгружен. Добавление в документ запрещено." + Символы.ПС
	//	+ "Штрихкод: " + Штрихкод;
	//	Возврат Результат;
	//КонецЕсли;
	
	//Если Результат.Стерилизован Тогда
	//	Результат.ТекстОшибки =
	//	"Ярлык уже стерилизован. Добавление в документ запрещено." + Символы.ПС
	//	+ "Штрихкод: " + Штрихкод;
	//	Возврат Результат;
	//КонецЕсли;
	// Проверка признаков номенклатуры
	Если Не Разр_НоменклатураПрошлаПроверкуПризнаков(Выборка.Номенклатура, Результат.ТекстОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция Разр_НоменклатураПрошлаПроверкуПризнаков(Номенклатура, ТекстОшибки)
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстОшибки = "В ярлыке не заполнена номенклатура.";
		Возврат Ложь;
	КонецЕсли;
	
	
	//Если Не Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция стерильная") 
	//	И НЕ Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат стерильный") Тогда
	//	ТекстОшибки = "У номенклатуры не установлен признак: Продукция стерильная или Полуфабрикат стерильный";
	//	Возврат Ложь;
	//КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеДопРеквизитаУстановлено(Номенклатура,ИдентификаторДляФормул,ИмяЗначенияСвойства)
	
	Свойство = Номенклатура.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул",ИдентификаторДляФормул));
	Если Свойство = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ИмяЗначенияСвойства,,,Свойство);
	
	Если Значение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЗначениеДопРеквизитаУстановлено()
